#### Terraform Initialization : success`
#### Terraform Plan : success`
<details><summary>Show Plan</summary>

```

[0m[1mdata.aws_security_group.data: Reading...[0m[0m
[0m[1mdata.aws_subnets.web: Reading...[0m[0m
[0m[1mdata.aws_route53_zone.ga_dev_zone: Reading...[0m[0m
[0m[1mdata.aws_subnets.app: Reading...[0m[0m
[0m[1mdata.aws_subnets.data: Reading...[0m[0m
[0m[1maws_efs_file_system.ga_efs: Refreshing state... [id=fs-04ea4c4a108ab4f9e][0m
[0m[1maws_acm_certificate.ga_certificate: Refreshing state... [id=arn:aws:acm:ca-central-1:654654488989:certificate/b060aada-a6a8-4977-a443-92acc046517b][0m
[0m[1maws_ecs_cluster.ga_cluster: Refreshing state... [id=arn:aws:ecs:ca-central-1:654654488989:cluster/ga-cluster-issue-7][0m
[0m[1mdata.aws_security_group.app: Reading...[0m[0m
[0m[1maws_alb_target_group.ga_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:654654488989:targetgroup/ga-tg-issue-7/0c6b4bfa97e44b8c][0m
[0m[1mdata.aws_security_group.web: Reading...[0m[0m
[0m[1mdata.aws_subnets.data: Read complete after 1s [id=ca-central-1][0m
[0m[1maws_route53_zone.ga_zone: Refreshing state... [id=Z0546064WCGFCLIEGDMY][0m
[0m[1mdata.aws_subnets.app: Read complete after 1s [id=ca-central-1][0m
[0m[1maws_ecs_cluster_capacity_providers.ga_cluster_capacity_providers: Refreshing state... [id=ga-cluster-issue-7][0m
[0m[1mdata.aws_subnets.web: Read complete after 1s [id=ca-central-1][0m
[0m[1maws_db_subnet_group.data: Refreshing state... [id=ga-db-issue-7-subnet-group][0m
[0m[1mdata.aws_security_group.app: Read complete after 1s [id=sg-0878a48c1cdda6aa6][0m
[0m[1mdata.aws_security_group.data: Read complete after 1s [id=sg-05f32ed700a41ccac][0m
[0m[1maws_efs_access_point.ga_ap_tomcatserver2: Refreshing state... [id=fsap-0cd3ccafdf23a1175][0m
[0m[1maws_efs_access_point.ga_ap_tomcatserver1: Refreshing state... [id=fsap-086c74df057080675][0m
[0m[1maws_efs_access_point.ga_ap_userdata: Refreshing state... [id=fsap-019d5a8a92142365f][0m
[0m[1maws_efs_access_point.ga_ap_ghttpsroot1: Refreshing state... [id=fsap-02e25f1786efe6ace][0m
[0m[1mdata.aws_security_group.web: Read complete after 0s [id=sg-09ac571e9bacb12da][0m
[0m[1maws_efs_access_point.ga_ap_root: Refreshing state... [id=fsap-06663a31ddaa6a9c4][0m
[0m[1maws_efs_access_point.ga_ap_upgrader2: Refreshing state... [id=fsap-0545405ec455802a7][0m
[0m[1maws_efs_access_point.ga_ap_config2: Refreshing state... [id=fsap-023b62ae6e1943497][0m
[0m[1maws_efs_access_point.ga_ap_sharedconfig: Refreshing state... [id=fsap-067956cc1a831afd8][0m
[0m[1mdata.aws_route53_zone.ga_dev_zone: Read complete after 1s [id=Z10207542GS9DRXRUX91S][0m
[0m[1maws_efs_mount_target.ga_efs_mount_target_1: Refreshing state... [id=fsmt-082cbe10e77a6826b][0m
[0m[1maws_efs_access_point.ga_ap_config1: Refreshing state... [id=fsap-0acd64a799b27b135][0m
[0m[1maws_efs_access_point.ga_ap_tomcatlog2: Refreshing state... [id=fsap-0d0340a7d9e140161][0m
[0m[1maws_efs_mount_target.ga_efs_mount_target_2: Refreshing state... [id=fsmt-0c1beb20d1debaee1][0m
[0m[1maws_efs_access_point.ga_ap_tomcatlog1: Refreshing state... [id=fsap-046445a8dfca742dc][0m
[0m[1maws_efs_access_point.ga_ap_upgrader1: Refreshing state... [id=fsap-0b9c86bc33e251560][0m
[0m[1maws_efs_access_point.ga_ap_ghttpsroot2: Refreshing state... [id=fsap-04caadfb7e463a65e][0m
[0m[1maws_route53_record.ga_record_ns: Refreshing state... [id=Z10207542GS9DRXRUX91S_issue-7.ga-dev.bac-lac.ca_NS][0m
[0m[1maws_lb.ga_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:654654488989:loadbalancer/app/ga-lb-issue-7/0fef43349665b33c][0m
[0m[1maws_route53_record.ga_record_cname["issue-7.ga-dev.bac-lac.ca"]: Refreshing state... [id=Z0546064WCGFCLIEGDMY__24d4fcb49a6e18bc2732d0320e66637e.issue-7.ga-dev.bac-lac.ca._CNAME][0m
[0m[1maws_ecs_task_definition.ga_task_definition: Refreshing state... [id=ga-task-definition-issue-7][0m
[0m[1maws_db_instance.ga_mysql: Refreshing state... [id=db-ZMXPDFJCLMKNWHDBQFG4SYRDIQ][0m
[0m[1maws_ecs_service.ga_service: Refreshing state... [id=arn:aws:ecs:ca-central-1:654654488989:service/ga-cluster-issue-7/ga-service-issue-7][0m
[0m[1maws_acm_certificate_validation.ga_certificate_validation: Refreshing state... [id=2024-06-05 18:02:41.217 +0000 UTC][0m
[0m[1maws_route53_record.ga_record_a: Refreshing state... [id=Z0546064WCGFCLIEGDMY_issue-7.ga-dev.bac-lac.ca_A][0m
[0m[1maws_alb_listener.http_80: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:654654488989:listener/app/ga-lb-issue-7/0fef43349665b33c/2e16f01c68a98304][0m
[0m[1maws_alb_listener.ga_443: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:654654488989:listener/app/ga-lb-issue-7/0fef43349665b33c/d021d72d6efbaf06][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_db_instance.ga_mysql[0m will be created
[0m  [32m+[0m[0m resource "aws_db_instance" "ga_mysql" {
      [32m+[0m[0m address                               = (known after apply)
      [32m+[0m[0m allocated_storage                     = 20
      [32m+[0m[0m apply_immediately                     = false
      [32m+[0m[0m arn                                   = (known after apply)
      [32m+[0m[0m auto_minor_version_upgrade            = true
      [32m+[0m[0m availability_zone                     = (known after apply)
      [32m+[0m[0m backup_retention_period               = (known after apply)
      [32m+[0m[0m backup_target                         = (known after apply)
      [32m+[0m[0m backup_window                         = (known after apply)
      [32m+[0m[0m ca_cert_identifier                    = (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [32m+[0m[0m copy_tags_to_snapshot                 = false
      [32m+[0m[0m db_name                               = (sensitive value)
      [32m+[0m[0m db_subnet_group_name                  = (sensitive value)
      [32m+[0m[0m delete_automated_backups              = true
      [32m+[0m[0m domain_fqdn                           = (known after apply)
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m engine                                = "mysql"
      [32m+[0m[0m engine_version                        = "8.0.35"
      [32m+[0m[0m engine_version_actual                 = (known after apply)
      [32m+[0m[0m hosted_zone_id                        = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m identifier                            = (known after apply)
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [32m+[0m[0m instance_class                        = "db.t3.micro"
      [32m+[0m[0m iops                                  = (known after apply)
      [32m+[0m[0m kms_key_id                            = (known after apply)
      [32m+[0m[0m latest_restorable_time                = (known after apply)
      [32m+[0m[0m license_model                         = (known after apply)
      [32m+[0m[0m listener_endpoint                     = (known after apply)
      [32m+[0m[0m maintenance_window                    = (known after apply)
      [32m+[0m[0m master_user_secret                    = (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m monitoring_interval                   = 0
      [32m+[0m[0m monitoring_role_arn                   = (known after apply)
      [32m+[0m[0m multi_az                              = (known after apply)
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [32m+[0m[0m network_type                          = (known after apply)
      [32m+[0m[0m option_group_name                     = (known after apply)
      [32m+[0m[0m parameter_group_name                  = "default.mysql8.0"
      [32m+[0m[0m password                              = (sensitive value)
      [32m+[0m[0m performance_insights_enabled          = false
      [32m+[0m[0m performance_insights_kms_key_id       = (known after apply)
      [32m+[0m[0m performance_insights_retention_period = (known after apply)
      [32m+[0m[0m port                                  = (known after apply)
      [32m+[0m[0m publicly_accessible                   = false
      [32m+[0m[0m replica_mode                          = (known after apply)
      [32m+[0m[0m replicas                              = (known after apply)
      [32m+[0m[0m resource_id                           = (known after apply)
      [32m+[0m[0m skip_final_snapshot                   = true
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [32m+[0m[0m status                                = (known after apply)
      [32m+[0m[0m storage_encrypted                     = true
      [32m+[0m[0m storage_throughput                    = (known after apply)
      [32m+[0m[0m storage_type                          = (known after apply)
      [32m+[0m[0m tags_all                              = (known after apply)
      [32m+[0m[0m timezone                              = (known after apply)
      [32m+[0m[0m username                              = (sensitive value)
      [32m+[0m[0m vpc_security_group_ids                = [
          [32m+[0m[0m "sg-05f32ed700a41ccac",
        ]
    }

[1m  # aws_db_subnet_group.data[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_db_subnet_group" "data" {
      [33m~[0m[0m arn                     = "arn:aws:rds:ca-central-1:654654488989:subgrp:ga-db-issue-7-subnet-group" -> (known after apply)
      [33m~[0m[0m id                      = "ga-db-issue-7-subnet-group" -> (known after apply)
      [33m~[0m[0m name                    = (sensitive value) [31m# forces replacement[0m[0m
      [32m+[0m[0m name_prefix             = (known after apply)
      [33m~[0m[0m supported_network_types = [
          [31m-[0m[0m "IPV4",
        ] -> (known after apply)
      [31m-[0m[0m tags                    = {} [90m-> null[0m[0m
      [33m~[0m[0m tags_all                = {} -> (known after apply)
      [33m~[0m[0m vpc_id                  = "vpc-0fd2c253aa148a2cf" -> (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_lb.ga_lb[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lb" "ga_lb" {
        id                                                           = "arn:aws:elasticloadbalancing:ca-central-1:654654488989:loadbalancer/app/ga-lb-issue-7/0fef43349665b33c"
        name                                                         = (sensitive value)
        tags                                                         = {
            "Environment" = "dev"
            "Name"        = (sensitive value)
        }
        [90m# (25 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m access_logs {
          [33m~[0m[0m enabled = true [33m->[0m[0m false
            [90m# (2 unchanged attributes hidden)[0m[0m
        }

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 2 to add, 1 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @mathieupetersonGC, Action: `pull_request`*